In [5]:
import pandas as pd
import numpy as np

In [3]:
PATH_TO_DATA = 'E:/Edureka_Python-Course/Data Sources/Day_4/'

**Question 1, 2, 3, 4

In [6]:
df_raw = pd.read_csv(f'{PATH_TO_DATA}SalaryGender.csv',low_memory=False)
df_raw

    Salary  Gender  Age  PhD
0    140.0       1   47    1
1     30.0       0   65    1
2     35.1       0   56    0
3     30.0       1   23    0
4     80.0       0   53    1
..     ...     ...  ...  ...
95    18.6       1   26    0
96   152.0       1   56    1
97     1.8       1   28    0
98    35.0       0   44    0
99     4.0       0   24    0

[100 rows x 4 columns]

In [ ]:
Salary, Gender, Age, PhD = df_raw.Salary, df_raw.Gender